[
    {
      "_id": "1",
      "name": "Motherboard ",
      "pic":"https://upload.wikimedia.org/wikipedia/commons/b/b7/Computer-motherboard.jpg",
      "description": "A motherboard is the main printed circuit board (PCB) in a computer. The motherboard is a computer's central communications backbone connectivity point, through which all components and external peripherals connect. Motherboards can be found in virtually all computers, especially desktop and laptop PCs."
    },
    {
      "_id": "2",
      "name": "Processor",
      "pic":"https://www.redhat.com/sysadmin/sites/default/files/styles/google_discover/public/2020-07/cpu-564771_1920%20Cropped.jpg?itok=hDSdriO6",
      "description": "A central processing unit (CPU), also called a central processor, main processor or just processor, is the electronic circuitry that executes instructions comprising a computer program. The CPU performs basic arithmetic, logic, controlling, and input/output (I/O) operations specified by the instructions in the program. This contrasts with external components such as main memory and I/O circuitry,[1] and specialized processors such as graphics processing units (GPUs)."
    },
    {
      "_id": "3",
      "name": "RAM",
      "pic":"https://cdn2.hubspot.net/hubfs/4650993/New_Avast_Academy/What%20is%20RAM%20memory/What_is_RAM-Thumb.jpg",
      "description": "RAM stands for random-access memory, but what does that mean? Your computer RAM is essentially short term memory where data is stored as the processor needs it. "
    },
    {
      "_id": "4",
      "name": "Hard drive",
      "pic":"https://cdn.hswstatic.com/gif/adding-a-hard-disk-1-1.jpg",
      "description": "hard disk, also called hard disk drive or hard drive, magnetic storage medium for a computer. Hard disks are flat circular plates made of aluminum or glass and coated with a magnetic material."
    },
    {
      "_id": "5",
      "name": "Power supply unit.",
      "pic":"https://www.lifewire.com/thmb/tuU9pqbf1-7MMYnY_JYVaMKvGc8=/786x524/filters:fill(auto,1)/power-supply-5aba984fba617700376b877f.PNG",
      "description": "A power supply unit (PSU) converts mains AC to low-voltage regulated DC power for the internal components of a computer. Modern personal computers universally use switched-mode power supplies."
    },
    {
      "_id": "6",
      "name": "Video card.",
      "pic":"https://i.pcmag.com/imagery/roundups/011mqJbX48UXvfyLMvwkd1m-3..v1569470764.jpg",
      "description": "video card, also called graphics card, integrated circuit that generates the video signal sent to a computer display."
    }
  ]